Urban Data Science & Smart Cities <br>
URSP688Y <br>
Instructor: Chester Harvey <br>
Urban Studies & Planning <br>
National Center for Smart Growth <br>
University of Maryland

[<img src="https://colab.research.google.com/assets/colab-badge.svg"> Clean version](https://colab.research.google.com/github/ncsg/ursp688y_sp2024/blob/main/demos/demo03/demo03.ipynb)

[<img src="https://colab.research.google.com/assets/colab-badge.svg"> Modified in class](https://colab.research.google.com/drive/11bvlfaXuamFZ__Bb97a2IGYom05Mtj5z?usp=sharing)

# Demo 3 - Tabular Analysis

(not necessarily in this order)

- Importing packages
- Documentation
- Classes
- Table structure
  - Tidy data
- Pandas
  - DataFrames
  - Calculations with columns
  - Series
  - Previewing
  - Selection and filtering
  - Grouping
  - Apply
  - Converting wide to long
- Using a debugger

## Importing packages

Now that we have basic data structures under our belts—integers, floats, booleans, strings, lists, and dictionaries—we can put them together into a more complex and capable data structure: a table.

We could write our own custom code to combine lists and dictionaries into a table, *or* we could use someone else's code (actually, many, many other peoples' code) to do this in a way that has become an industry standard. (Will you write the next industry-standard Python tool? More on that later in the semester...)

The easiest way to use other peoples' code in a way that is well-tested and documented is through a **package**.

Many packages come pre-installed with CoLab, so all we have to do is import them into our namespace.

Later in the semester, we'll learn how to install additional packages, and maybe even make our own packages.

To import a package into your namespace, use the special `import` command, demonstrated below.

Packages are often imported with aliases for brevity. I'll use the standard aliases, but they are technically arbitrary, just like variable names.

## Pandas

[_Pandas_](https://pandas.pydata.org/) (Python Data Analysis Library) is currently the most popular way to analyze tables in Python.

The tabular data structure at the heart of Pandas is the `DataFrame`.

Let's import `pandas` with the alias `pd` for short.

In [1]:
import pandas as pd # Note I'm importing the package with an alias: pd. This is for brevity.
                    # The 'as' keyword acts like an assignment operator,
                    # assigning the name 'pd' to the contents of the pandas package

### DataFrames

Now we can use pandas to make a `DataFrame`.

Notice that we're just entering dictionaries, strings, and ints? Under the hood, Pandas is also storing these data with these basic types. But it will give us a lot of tools to do sophisticated things with them.

In [2]:
columnwise_data = {
    'english': {'Daniela': 83, 'Zoe': 97, 'Rowen': 77, 'Jude': 95, 'Austin': 87, 'Jasper': 92, 'Liora': 88, 'Kieran': 72},
    'math': {'Daniela': 95, 'Zoe': 83, 'Rowen': 73, 'Jude': 80, 'Austin': 100, 'Jasper': 94, 'Liora': 89, 'Kieran': 96},
    'science': {'Daniela': 90, 'Zoe': 87, 'Rowen': 95, 'Jude': 73, 'Austin': 80, 'Jasper': 99, 'Liora': 87, 'Kieran': 90},
    'gender':{'Daniela': 'female', 'Zoe': 'female', 'Rowen': 'male', 'Jude': 'non-binary', 'Austin': 'male', 'Jasper': 'non-binary', 'Liora': 'female', 'Kieran': 'male'},
}

df = pd.DataFrame(columnwise_data)
df

         english  math  science      gender
Daniela       83    95       90      female
Zoe           97    83       87      female
Rowen         77    73       95        male
Jude          95    80       73  non-binary
Austin        87   100       80        male
Jasper        92    94       99  non-binary
Liora         88    89       87      female
Kieran        72    96       90        male

We could also enter the same data with a different structure. Rather than nested dictionaries, each representing a named column, we have a list of dictionaries, each representing a row (or in database-speak, a 'record').

In [3]:
recordwise_data = [
    {'name': 'Daniela', 'english': 83, 'math': 95, 'science': 90, 'gender':'female'},
    {'name': 'Zoe', 'english': 97, 'math': 83, 'science': 87, 'gender':'female'},
    {'name': 'Rowen', 'english': 77, 'math': 73, 'science': 95, 'gender':'male'},
    {'name': 'Jude', 'english': 95, 'math': 80, 'science': 73, 'gender':'non-binary'},
    {'name': 'Austin', 'english': 87, 'math': 100, 'science': 80, 'gender':'male'},
    {'name': 'Jasper', 'english': 92, 'math': 94, 'science': 99, 'gender':'non-binary'},
    {'name': 'Liora', 'english': 88, 'math': 89, 'science': 87, 'gender':'female'},
    {'name': 'Kieran', 'english': 72, 'math': 96, 'science': 90, 'gender':'male'},
]

df_recordwise = pd.DataFrame.from_records(recordwise_data) # Pandas will automatically recognize this recordwise structure,
                                                # but you can be explicit about it with the `from_records` method
df_recordwise

      name  english  math  science      gender
0  Daniela       83    95       90      female
1      Zoe       97    83       87      female
2    Rowen       77    73       95        male
3     Jude       95    80       73  non-binary
4   Austin       87   100       80        male
5   Jasper       92    94       99  non-binary
6    Liora       88    89       87      female
7   Kieran       72    96       90        male

## Sidebar: Documentation

This is a good time for a tangent on documentation.

A benefit of well-established packages is that they come with lots of good instructions and examples.

You can access that documentation in a variety of ways.

In [4]:
# Use the `help` function directly in Python
# help(pd.DataFrame) # This can get overwhelming fast...

Approximately the same information, in a much easier-to-read format, should be available in the [package's online documentation](https://pandas.pydata.org/docs/user_guide/index.html#user-guide).

In general, the more established the package, and the more contributors, the better the documentation tends to be.

## Sidebar: Classes

With Dataframes, we are getting more involved with a very powerful variety of Python object called a `class`.

Fundamentally, you have already been using classes without knowing it. All data types are classes: `int`, `float`, `str`, `list`, `dict`, etc.

It's also possible to make your own customized classes, building on existing ones. For now, we're going to use other peoples' customized classes. Eventually, we might make our own.

Classes store data along with functions that let you do specific things with those data. These special functions, stored inside classes, are called `methods`.

For example, the `str` class has many convenient methods:

In [5]:
x = 'Chester'
x.lower() # Notice that running a method requires parentheses, just like a function.
          # Sometimes, they take arguments, also like a function.

'chester'

Classes can also have built-in attributes. But strings don't have any by default, so let's use our dataframe as an example instead:

In [6]:
df.columns # Notice you don't use parentheses when accessing an attribute because it's not running a process, just looking up a piece of data

Index(['english', 'math', 'science', 'gender'], dtype='object')

You can see all the attributes and methods available for a class in it's [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html) or with the built-in `dir` function:

In [7]:
# dir(pd.DataFrame)

### Class Instances

One reason classes are so powerful is that they provide a structure for replication. They are essentially templates for storing information that can be slightly customized in many seperate _instances_.

The class `pd.DataFrame` is the template used to create a dataframe. If we make a dataframe instance, it will have all the same basic structure of the overarching class, but it will also have unique attributes related to the inputs used to build it.

For example, the dataframe we made above is an instance of the `pd.DataFrame` class:

In [8]:
type(df)

pandas.core.frame.DataFrame

But because we populated it with specific data, it has attributes specific to it, such as the column names:

In [9]:
df.columns

# dif(df) # Notice this will show some attributes unique to this instance

Index(['english', 'math', 'science', 'gender'], dtype='object')

## Calculations with columns

Now that we're familiar with what classes (like DataFrames) can do in the abstract, let's start using them to do some analysis.

Last week, we learned about loops, and don't forget them! They will always be an important basic tool.

However, tables let you do calculations that are loop-like with more concise syntax and (often) more computational efficiency.

Let's say we wanted to calculate the average of grades for each student across their three subjects. We could do this calculation across the entire table at once:

In [10]:
df[['english','math','science']].mean(axis=1)

Daniela    89.333333
Zoe        89.000000
Rowen      81.666667
Jude       82.666667
Austin     89.000000
Jasper     95.000000
Liora      88.000000
Kieran     86.000000
dtype: float64

Then we could assign that those calculated values to a new column

In [11]:
df['mean'] = df[['english','math','science']].mean(axis=1)
df

         english  math  science      gender       mean
Daniela       83    95       90      female  89.333333
Zoe           97    83       87      female  89.000000
Rowen         77    73       95        male  81.666667
Jude          95    80       73  non-binary  82.666667
Austin        87   100       80        male  89.000000
Jasper        92    94       99  non-binary  95.000000
Liora         88    89       87      female  88.000000
Kieran        72    96       90        male  86.000000

We could also make a calculation across rows. What's the average grade in English?

In [12]:
df['english'].mean()

86.375

## Sidebar: Series

A single row or column in a Pandas DataFrame is a `Series`, which is its own class. DataFrames are made up of Series, which are basically fancy lists. The major difference between a DataFrame and a Series is that DataFrames are two-dimensional, whereas Series are one-dimensional.

In [13]:
type(df['english'])

pandas.core.series.Series

## Sidebar: Previewing DataFrames

Dataframes can get big fast. It can be helpful just to see the first few rows, or just to see the column names.

the `head` method is used to show the first five rows by default, or you can set the argument with the number you want to see.

In [14]:
df.head()

         english  math  science      gender       mean
Daniela       83    95       90      female  89.333333
Zoe           97    83       87      female  89.000000
Rowen         77    73       95        male  81.666667
Jude          95    80       73  non-binary  82.666667
Austin        87   100       80        male  89.000000

The `columns` attribute is very handy for listing all the columns. I tend to add the `to_list` method so Jupyter prints them out nicely without extra clutter.

In [15]:
df.columns.tolist()

['english', 'math', 'science', 'gender', 'mean']

In [16]:
# pd.concat([df, df, df], axis=1).columns.tolist() # Use to demonstrate a DataFrame with more columns
#                                                  # (I just concatenated three of the same df together)

The `value_counts` method is very handy for previewing unique values in a column.

In [17]:
df['gender'].value_counts()

gender
female        3
male          3
non-binary    2
Name: count, dtype: int64

## Selecting and filtering

As part of that column calculation, we needed to select only part of a DataFrame: the columns for each subject. This is sometimes called 'slicing.'

Columns and rows are identified by the bold headers to the left and top. You can select data based on these headers.

In [18]:
df['english'] # One column

Daniela    83
Zoe        97
Rowen      77
Jude       95
Austin     87
Jasper     92
Liora      88
Kieran     72
Name: english, dtype: int64

In [19]:
df[['english','math','science']] # Multiple columns; note that the input is a list of column names

         english  math  science
Daniela       83    95       90
Zoe           97    83       87
Rowen         77    73       95
Jude          95    80       73
Austin        87   100       80
Jasper        92    94       99
Liora         88    89       87
Kieran        72    96       90

In [20]:
df.loc['Daniela'] # One row based on index value

english           83
math              95
science           90
gender        female
mean       89.333333
Name: Daniela, dtype: object

In [21]:
df.iloc[0] # One row based on index order (starting with 0)

english           83
math              95
science           90
gender        female
mean       89.333333
Name: Daniela, dtype: object

In [22]:
df.at['Daniela', 'english'] # Single value

83

### Filtering

You can also retrieve a subset of a DataFrame based on a condition. This requires making a 'boolean mask', then selecting by that mask. Pandas will only return the rows or columns that are `True` in the mask.

In [23]:
mask = df['gender'] == 'female'
mask

Daniela     True
Zoe         True
Rowen      False
Jude       False
Austin     False
Jasper     False
Liora       True
Kieran     False
Name: gender, dtype: bool

In [24]:
df[mask]

# df[df['gender'] == 'female'] # For something this simple, we would typically define the mask inside the selection

         english  math  science  gender       mean
Daniela       83    95       90  female  89.333333
Zoe           97    83       87  female  89.000000
Liora         88    89       87  female  88.000000

## Grouping

A very powerful thing to do with tables is to group rows, then make calculations within groups. This is like PivotTable in Excel.

Let's calculate the average grade in English by gender.

In [25]:
df.groupby('gender')['english'].mean()

gender
female        89.333333
male          78.666667
non-binary    93.500000
Name: english, dtype: float64

## Table structure

Not all tables are alike. Some are organized in ways that make them easy to read in a report. Others might be organized in a way that makes it easy to do analyses with them. Of course, this organization might be different depending on the analysis.

### Tidy data

Data scientists like to talk about **tidy data**. This concept was [popularized by Hadley Wickham](https://vita.had.co.nz/papers/tidy-data.pdf), who authored much of the [tidyverse](https://www.tidyverse.org/) library for tabular analysis in R, which has many of the same functions as Pandas.

Tidy data has three main properties ([see Wickham's paper for more details](https://vita.had.co.nz/papers/tidy-data.pdf)):
1. Each variable forms a column.
2. Each observation forms a row.
3. Each type of observational unit forms a table.

What this means, in practice, is that all calculations you might want to make with your data can be achieved by operating on entire columns, entire rows, or logical subsets of them (e.g., selections or groups).

To understand what this means, let's look at an **un**-tidy table:

<img src="https://communities.sas.com/t5/image/serverpage/image-id/15240i254B7F6F4F917A64/image-size/large?v=v2&px=999" alt="Regression Table" width="1000"/>

([Source](https://communities.sas.com/t5/SAS-Procedures/Making-a-publication-quality-table-from-regression-results-using/td-p/396779))

This is a very common type of table reporting outputs from regression, a type of statistical model.

A few key things to notice:
1. This is actually two tables smashed into one, each with its own observational unit.
    - The top half reports model estimates for each listed variable: 'treatment' and 'Constant'.
    - The bottom provides summary statistics each model as a whole: 'Observations', 'R-squared', etc.
    - This is fine for human reading—indeed, it is extremely common.
    - It is a nightmare for analysis. If we loaded these data into Pandas, we would want to separate into two separate tables.
2. The columns in the top half of the table include multiple types of variables.
    - Regression coefficients with asterisks indicating statistical significance are on top
    - Standard errors in parentheses are below
    - A tidy data table would represent all these variables in separate columns: coefficient, significance, and standard error
3. The top half of the table shows essentially the same thing three times, once for each model: (1), (2), and (3).
    - This is what's called a "wide" table orientation. It has observations grouped by row.
    - A "long" orientation, with each observation in a separate row, would be much more flexible for analysis.
    - This would involve an additional column to store the model name, but would reduce the overall number of colums from 9 (3 for each model) to 4 (1 model column + 3 for coefficient, significance, and standard error)
  
### Converting wide to long

Let's practice restructuring data with our example above:

In [26]:
df_recordwise

      name  english  math  science      gender
0  Daniela       83    95       90      female
1      Zoe       97    83       87      female
2    Rowen       77    73       95        male
3     Jude       95    80       73  non-binary
4   Austin       87   100       80        male
5   Jasper       92    94       99  non-binary
6    Liora       88    89       87      female
7   Kieran       72    96       90        male

We could restructure the table with 'subject' and 'grade' columns instead of having separate columns for grades in each subject.

`pd.melt` is the most flexible function for reshaping a DataFrame from wide to long.

`pd.wide_to_long` can be easier to use in certain cases, but requires very specific column names.

In [27]:
df_long = pd.melt(
    df_recordwise, 
    id_vars=['name','gender'], 
    value_vars=['english','math','science'], 
    var_name='subject', 
    value_name='grade',
)
df_long

       name      gender  subject  grade
0   Daniela      female  english     83
1       Zoe      female  english     97
2     Rowen        male  english     77
3      Jude  non-binary  english     95
4    Austin        male  english     87
5    Jasper  non-binary  english     92
6     Liora      female  english     88
7    Kieran        male  english     72
8   Daniela      female     math     95
9       Zoe      female     math     83
10    Rowen        male     math     73
11     Jude  non-binary     math     80
12   Austin        male     math    100
13   Jasper  non-binary     math     94
14    Liora      female     math     89
15   Kieran        male     math     96
16  Daniela      female  science     90
17      Zoe      female  science     87
18    Rowen        male  science     95
19     Jude  non-binary  science     73
20   Austin        male  science     80
21   Jasper  non-binary  science     99
22    Liora      female  science     87
23   Kieran        male  science     90

Note that we can still calculate the average grade for each person, but through a slightly different approach that involves grouping.

In [28]:
df_long.groupby('name')['grade'].mean()

name
Austin     89.000000
Daniela    89.333333
Jasper     95.000000
Jude       82.666667
Kieran     86.000000
Liora      88.000000
Rowen      81.666667
Zoe        89.000000
Name: grade, dtype: float64

We can also very easily calculate other summaries with different subsets of the data.

Let's see what the highest grade was for female students in each subject. Or for each gender.

In [29]:
df_long[df_long['gender'] == 'female'].groupby(['subject'])['grade'].max()

subject
english    97
math       95
science    90
Name: grade, dtype: int64

In [30]:
df_long.groupby(['subject','gender'])['grade'].max()

subject  gender
english  female         97
         male           87
         non-binary     95
math     female         95
         male          100
         non-binary     94
science  female         90
         male           95
         non-binary     99
Name: grade, dtype: int64

## Apply

While you can do a lot of things with entire columns in DataFrames, sometimes it's still really helpful to do something iteratively, similar to a loop. This is especially good for very customized functions.

The `apply` method applies a function iteratively across an entire column (or row or whole DataFrame).

In the simplest (and most common) case, you write the function to accept the value from a single DataFrame cell, and return another single value.

In [31]:
def get_first_and_last_letter(x):
    first = x[0].lower()
    last = x[-1].lower()
    return f'{first}{last}'

In [32]:
df_long['name_first_and_last_letter'] = df_long['name'].apply(get_first_and_last_letter)
df_long.head()

      name      gender  subject  grade name_first_and_last_letter
0  Daniela      female  english     83                         da
1      Zoe      female  english     97                         ze
2    Rowen        male  english     77                         rn
3     Jude  non-binary  english     95                         je
4   Austin        male  english     87                         an

## Using a debugger

Sometimes things just really don't work and it's hard to figure out why. This can be especially true when there is a lot of nesting with names accessible only inside functions or loops.

There are special tools for debugging that can help step through code one line at a time, stop in specific places, and understand the values stored in variables at specific points in the program.

A good way to [implement this in a Jupyter notebook](https://zohaib.me/debugging-in-google-collab-notebook/), including CoLab, is with a package called `ipdb`. Unfortunately, ipdb does not come pre-installed with CoLab, so we'll need to install it before we can import it.

This is as easy as using a special character (`!`) to ask CoLab to run a command as if it was on the computer's command line, not with the Python interpreter.

We're using a program called `pip`, which goes to its internet repositories, downloads ipdb, and installs it.

With CoLab, you need to do this every time you use it because it wipes your virtual computer clean when your session times out.

In [33]:
!pip install -Uqq ipdb # This version will run 'quietly'

# !pip install ipdb # This version will show log outputs

Now that we have ipdb, we can import it and start debugging.

In [34]:
import ipdb

Here's a loop with a logic error (this may look familiar from last week):

In [35]:
people = {'Daniela': 5, 'Rowen': 65, 'Zoe': 10, 'Jude': 81, 'Austin': 45}

for name, age in people.items():
    if age < 18:
        age_desc = 'a child'
    else:
        age_des = 'an adult'
    # ipdb.set_trace() # Here is the breakpoint where we'll inspect
    print(f'{name} is {age_desc}')

Daniela is a child
Rowen is a child
Zoe is a child
Jude is a child
Austin is a child

Let's use ipdb to dig into why every person is being listed as a child rather than an adult.

First, we have to turn the debugger on. We use a shortcut called a 'magic command,' which is only valid within a notebook. It isn't technically Python.

In [36]:
%pdb on

# %pdb off # Turn it off

Automatic pdb calling has been turned ON

### Breakpoints

Add `ipdb.set_trace()` anywhere in program to stop it for inspection.

Then use commands to continue flow as needed.

|Command|Description|
|--- |--- |
|h(elp)|Show various commands supported by ipdb|
|h(elp) COMMAND|Show description of the COMMAND specificed|
|c(ontinue)|Continue executing till it hits another breakpoint|
|n(ext)|Execute till next line in the same code frame. So if there is a function it wouldn't step into that function but execute it.|
|s(tep)|Step to next code, so if its a function, it will step into the function.|
|r(eturn)|Execute code till it returns from the current function or hits another breakpoint.|
|l(ist)|Show more of the source code surrounding the  line.|
|w(here)|Shows the stacktrace i.e. the chain of functions that made it reach the current function|
|a(rguments)|List of arguments passed and its values to the function|
|q(uit)|Immediately stop execution and quit the debugger|